       01  USER-RECORD.
           05 U-ID              PIC 9(8).
           05 U-USERNAME        PIC X(30).
           05 U-PASSWORD        PIC X(64).
           05 U-EMAIL           PIC X(50).
           05 U-SCORE           PIC 9(8).
           05 U-RANK            PIC 9(8).
           05 U-KEY             PIC X(30).
           05 U-SCORE-M         PIC 9(8).
           05 U-BAGE            PIC 9(4).
